; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v3 - type_3 ?v4 - type_2)
 	      (pred_1 ?v5 - object ?v4 - type_2)
	      (pred_4 ?v3 - type_3 ?v1 - type_1)
	      (pred_2 ?v3 - type_3 ?v5 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v3 - type_3 ?v7 ?v6 - type_2)
       :precondition (and  (pred_3 ?v3 ?v7))
       :effect (and  (pred_3 ?v3 ?v6)
		     (not (pred_3 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_3 ?v8 - object ?v2 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v2) (pred_3 ?v3 ?v2) (pred_4 ?v3 ?v1))
       :effect (and (pred_2 ?v3 ?v8 ?v1)
		    (not (pred_1 ?v8 ?v2)) 
		    (not (pred_4 ?v3 ?v1))))

   (:action op_1
       :parameters (?v3 - type_3 ?v8 - object ?v2 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v8 ?v1) (pred_3 ?v3 ?v2))
       :effect (and (pred_1 ?v8 ?v2)
		    (pred_4 ?v3 ?v1)
		    (not (pred_2 ?v3 ?v8 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_03 obj_04 - type_3
obj_06 obj_07 obj_09 obj_13 - type_1
obj_01 obj_10 obj_11 obj_02 - type_2
obj_08 obj_05 obj_12 obj_14 - object)
(:init
(pred_3 obj_03 obj_01)
(pred_4 obj_03 obj_06)
(pred_4 obj_03 obj_07)
(pred_3 obj_04 obj_01)
(pred_4 obj_04 obj_09)
(pred_4 obj_04 obj_13)
(pred_1 obj_08 obj_11)
(pred_1 obj_05 obj_02)
(pred_1 obj_12 obj_10)
(pred_1 obj_14 obj_11)
)
(:goal
(and
(pred_1 obj_08 obj_02)
(pred_1 obj_05 obj_10)
(pred_1 obj_12 obj_11)
(pred_1 obj_14 obj_10)
)
)

(:constraints
  (always (not (pred_3 obj_03 obj_11)))
)
)

; plan
1. (op_2 obj_03 obj_01 obj_10)
   deleted: (pred_3 obj_03 obj_01)
   added: (pred_3 obj_03 obj_10)
   goals met: 0 of 4
2. (op_2 obj_04 obj_01 obj_10)
   deleted: (pred_3 obj_04 obj_01)
   added: (pred_3 obj_04 obj_10)
   goals met: 0 of 4
3. (op_3 obj_04 obj_12 obj_10 obj_13)
   deleted: (pred_1 obj_12 obj_10) (pred_4 obj_04 obj_13)
   added: (pred_2 obj_04 obj_12 obj_13)
   goals met: 0 of 4
4. (op_2 obj_04 obj_10 obj_11)
   deleted: (pred_3 obj_04 obj_10)
   added: (pred_3 obj_04 obj_11)
   goals met: 0 of 4
5. (op_1 obj_04 obj_12 obj_11 obj_13)
   deleted: (pred_2 obj_04 obj_12 obj_13)
   added: (pred_1 obj_12 obj_11) (pred_4 obj_04 obj_13)
   goals met: 1 of 4
6. (op_3 obj_04 obj_08 obj_11 obj_13)
   deleted: (pred_1 obj_08 obj_11) (pred_4 obj_04 obj_13)
   added: (pred_2 obj_04 obj_08 obj_13)
   goals met: 1 of 4
7. (op_2 obj_04 obj_11 obj_02)
   deleted: (pred_3 obj_04 obj_11)
   added: (pred_3 obj_04 obj_02)
   goals met: 1 of 4
8. (op_1 obj_04 obj_08 obj_02 obj_13)
   deleted: (pred_2 obj_04 obj_08 obj_13)
   added: (pred_1 obj_08 obj_02) (pred_4 obj_04 obj_13)
   goals met: 2 of 4
9. (op_3 obj_04 obj_05 obj_02 obj_13)
   deleted: (pred_1 obj_05 obj_02) (pred_4 obj_04 obj_13)
   added: (pred_2 obj_04 obj_05 obj_13)
   goals met: 2 of 4
10. (op_2 obj_04 obj_02 obj_10)
   deleted: (pred_3 obj_04 obj_02)
   added: (pred_3 obj_04 obj_10)
   goals met: 2 of 4
11. (op_1 obj_04 obj_05 obj_10 obj_13)
   deleted: (pred_2 obj_04 obj_05 obj_13)
   added: (pred_1 obj_05 obj_10) (pred_4 obj_04 obj_13)
   goals met: 3 of 4
12. (op_2 obj_04 obj_10 obj_11)
   deleted: (pred_3 obj_04 obj_10)
   added: (pred_3 obj_04 obj_11)
   goals met: 3 of 4
13. (op_3 obj_04 obj_14 obj_11 obj_13)
   deleted: (pred_1 obj_14 obj_11) (pred_4 obj_04 obj_13)
   added: (pred_2 obj_04 obj_14 obj_13)
   goals met: 3 of 4
14. (op_2 obj_04 obj_11 obj_10)
   deleted: (pred_3 obj_04 obj_11)
   added: (pred_3 obj_04 obj_10)
   goals met: 3 of 4
15. (op_1 obj_04 obj_14 obj_10 obj_13)
   deleted: (pred_2 obj_04 obj_14 obj_13)
   added: (pred_1 obj_14 obj_10) (pred_4 obj_04 obj_13)
   goals met: 4 of 4
